Res-perfCacheNStatA-media-v2/Res-container-random-v1/container_t_10_c_30_composeReviewServiceCore_4_wrkCore_1_R_400/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 4.644ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.984ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.601ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.508ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.616ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.750ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.675ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.799ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.596ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.823ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.34ms    0.98ms   8.28ms   81.27%
    Req/Sec    41.50     62.27   200.00     92.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.24ms
 75.000%    4.70ms
 90.000%    5.26ms
 99.000%    8.28ms
 99.900%   10.99ms
 99.990%   13.77ms
 99.999%   17.30ms
100.000%   17.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.107     0.000000            1         1.00
       3.373     0.100000         1992         1.11
       3.661     0.200000         3982         1.25
       3.875     0.300000         5984         1.43
       4.061     0.400000         7958         1.67
       4.235     0.500000         9950         2.00
       4.323     0.550000        10983         2.22
       4.407     0.600000        11942         2.50
       4.499     0.650000        12970         2.86
       4.587     0.700000        13933         3.33
       4.695     0.750000        14940         4.00
       4.755     0.775000        15447         4.44
       4.823     0.800000        15930         5.00
       4.895     0.825000        16427         5.71
       4.987     0.850000        16914         6.67
       5.107     0.875000        17414         8.00
       5.179     0.887500        17661         8.89
       5.259     0.900000        17905        10.00
       5.355     0.912500        18157        11.43
       5.479     0.925000        18402        13.33
       5.659     0.937500        18650        16.00
       5.775     0.943750        18779        17.78
       5.891     0.950000        18899        20.00
       6.075     0.956250        19021        22.86
       6.315     0.962500        19148        26.67
       6.627     0.968750        19271        32.00
       6.827     0.971875        19333        35.56
       7.035     0.975000        19395        40.00
       7.271     0.978125        19458        45.71
       7.467     0.981250        19519        53.33
       7.767     0.984375        19582        64.00
       7.907     0.985938        19612        71.11
       8.031     0.987500        19645        80.00
       8.207     0.989062        19674        91.43
       8.327     0.990625        19708       106.67
       8.503     0.992188        19736       128.00
       8.671     0.992969        19752       142.22
       8.807     0.993750        19767       160.00
       8.911     0.994531        19784       182.86
       9.111     0.995313        19799       213.33
       9.335     0.996094        19814       256.00
       9.439     0.996484        19822       284.44
       9.567     0.996875        19829       320.00
       9.687     0.997266        19837       365.71
       9.983     0.997656        19845       426.67
      10.183     0.998047        19853       512.00
      10.335     0.998242        19858       568.89
      10.391     0.998437        19860       640.00
      10.455     0.998633        19864       731.43
      10.839     0.998828        19868       853.33
      11.039     0.999023        19872      1024.00
      11.215     0.999121        19874      1137.78
      11.671     0.999219        19876      1280.00
      12.015     0.999316        19878      1462.86
      12.359     0.999414        19880      1706.67
      12.815     0.999512        19882      2048.00
      13.079     0.999561        19883      2275.56
      13.095     0.999609        19884      2560.00
      13.215     0.999658        19885      2925.71
      13.271     0.999707        19887      3413.33
      13.271     0.999756        19887      4096.00
      13.271     0.999780        19887      4551.11
      13.535     0.999805        19888      5120.00
      13.535     0.999829        19888      5851.43
      13.775     0.999854        19889      6826.67
      13.775     0.999878        19889      8192.00
      13.775     0.999890        19889      9102.22
      16.879     0.999902        19890     10240.00
      16.879     0.999915        19890     11702.86
      16.879     0.999927        19890     13653.33
      16.879     0.999939        19890     16384.00
      16.879     0.999945        19890     18204.44
      17.295     0.999951        19891     20480.00
      17.295     1.000000        19891          inf
#[Mean    =        4.344, StdDeviation   =        0.984]
#[Max     =       17.280, Total count    =        19891]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23899 requests in 1.00m, 4.19MB read
Requests/sec:    398.27
Transfer/sec:     71.56KB